{
  "0": {
    "abstract": "This poster summarizes the system description of the Vehicle detection pipeline, with an emphasis on augmentation and ensemble techniques. The submitted system at  <b>Dhaka AI Vehicle Detection Challenge</b> achieved 3rd place.",
    "title": "Team Passphrase: Dhaka AI Vehicle Detection",
    "link": "https://www.researchgate.net/profile/Sowmen-Das/publication/356039571_Team_Passphrase_Dhaka_AI_Vehicle_Detection_Challenge_4th_place_Submission/links/618a431b07be5f31b75c5c7f/Team-Passphrase-Dhaka-AI-Vehicle-Detection-Challenge-4th-place-Submission.pdf",
    "date": "2020",
    "publisher": "Dhaka AI",
    "authors": "Sowmen Das, <b>Nazia Tasnim</b>, Md Istiak Hossain Shihab, Mohammad Faiyaz Khan, Rafid Ameer Mahmud",
    "plot": "./assets/plots/vehicle.png"
  },
  "1": {
    "abstract": "In this work we perform data-mining on Bangla Newspaper data to analyze it's viability as a supplementary disease surveillance tool - as well as explore relationship between socio-economic status and dengue.",
    "title": "Observing the Unobserved: A Newspaper Based Dengue Surveillance System for the Low-Income Regions of Bangladesh",
    "link": "https://journals.flvc.org/FLAIRS/article/download/128552/130032",
    "date": "2021",
    "publisher": "Florida AI Research Society",
    "authors": "Nazia Tasnim, Md Istiak Hossain Shihab, Moqsadur Rahman, Jillur Rahman Saurav, Sheikh Rabiul Islam, Mohammad Ruhul Amin",
    "plot": "./assets/plots/dengue.png"
  },
  "2": {
    "abstract": "For the de novo assembly of the SARS-CoV-2 genomes, a myriad of assemblers is being used. In this study, we aim to understand the variabilities on assembly qualities due to the choice of the assemblers.",
    "title": "Choice of assemblers has a critical impact on de novo assembly of SARS-CoV-2 genome and characterizing variants",
    "link": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8083570/",
    "date": "2021",
    "publisher": "Briefings in bioinformatics",
    "authors": "Rashedul Islam, Rajan Saha Raju, Nazia Tasnim, Istiak Hossain Shihab, ..",
    "plot": "./assets/plots/bob.jpeg"
  },
  "3": {
    "abstract": "This workshop paper for the NAACL 2022 SemEval Workshop - Task 11 demonstrates our approach in tackling the challenge of <b>recognizing complex open-domain Named Entities in Bangla</b>, through <i>data augmentation</i> and <i>majority-voting based ensembling</i> efforts. The mode performed competitively in the task and <u>placed 8th in the overall global ranking</u>.",
    "title": "On leveraging data augmentation and ensemble to recognize complex Named Entities in Bangla",
    "link": "https://aclanthology.org/2022.semeval-1.209/",
    "date": "2022",
    "publisher": "ACL",
    "authors": " <b>Nazia Tasnim</b>, Md. Istiak Shihab, Asif Shahriyar Sushmit, Steven Bethard, Farig Sadeque",
    "plot": "./assets/plots/multi.png"
  },
  "4": {
    "abstract": "For robust and accurate detection of retail items, we propose a novel framework that combines the power of Vision Transformer (ViT) and U-Net. We also propose a novel image colorfulness frame filtration technique to filter out the frames that are not suitable for item detection.",
    "title": "VISTA: Vision Transformer enhanced by U-Net and Image Colorfulness Frame Filtration for Automatic Retail Checkout",
    "link": "https://openaccess.thecvf.com/content/CVPR2022W/AICity/papers/Shihab_VISTA_Vision_Transformer_Enhanced_by_U-Net_and_Image_Colorfulness_Frame_CVPRW_2022_paper.pdf",
    "date": "2022",
    "publisher": "CVPR",
    "authors": "Md Istiak Hossain Shihab,  <b>Nazia Tasnim</b>,  Hasib Zunair, Labiba Kanij Rupty, Nabeel Mohammed",
    "plot": "./assets/plots/vehicle.png"
  },
  "5": {
    "abstract": "We present OOD-Speech, the first out-of-distribution (OOD) benchmarking dataset for Bengali automatic speech recognition (ASR). Our training dataset is collected via massively online crowdsourcing campaigns which resulted in 1177.94 hours collected and curated from 22,645 native Bengali speakers from South Asia.",
    "title": "OOD-Speech: A Large Bengali Speech Recognition Dataset for Out-of-Distribution Benchmarking",
    "link": "https://arxiv.org/pdf/2305.09688",
    "date": "2023",
    "publisher": "INTERSPEECH'23",
    "authors": "Fazle Rabbi Rakib, Souhardya Saha Dip, Samiul Alam, Nazia Tasnim, Md Istiak Hossain Shihab, ...",
    "plot": "./assets/plots/ood.png"
  }
}
