{
  "9": {
    "name": "VISTA for Automated Retail Check-out",
    "description": "We developed an end-to-end pipeline combining SOTA and custom built heuristics to effectively identify and count retail product during real-time checkout. Our pipeline is amazingly light-weight, with a sufficient F1-score.",
    "tools": "CV, DL, PyTorch",
    "source": "https://github.com/istiakshihab/automated-retail-checkout-aicity22"
  },
  "8": {
    "name": "mwparserfromhtml",
    "description": "Python library for parsing and mining metadata from the <i>Enterprise HTML Dumps</i>. Useful for building lossless plaintext dataset from HTML dataset with little resource overhead. <a href='https://techblog.wikimedia.org/2023/02/24/from-hell-to-html/'> <b>Read more about the project here</b></a>",
    "tools": "python, regex, wikidump",
    "source": "https://pypi.org/project/mwparserfromhtml/"
  },
  "7": {
    "name": "Shaako",
    "description": " A mobile application with the rural people having little to no access to proper medical health care, to their nearest medical facilities instantly through their neighbourhood community health workers. The project became <u>second runners up in the Microsoft Imagine Cup - SEANM Health Track, in 2022. <a href='https://www.youtube.com/watch?v=AAKgAQp_-4Q&pp=ygUcc2hhYWtvIG1pY3Jvc29mdCBpbWFnaW5lIGN1cA%3D%3D'> <b>Demo Video</b></a>",

    "tools": "android, django, firebase, azure",
    "source": "https://github.com/WeDoinaThing"
  },
  "6": {
    "name": "SUSTCast",
    "description": "Fully automated online radio platform servicing over 2000 students of Shahjalal University of Science and Technology. <a href='https://play.google.com/store/apps/details?id=com.sust.sustcast'> <b>Playstore Link</b></a>",

    "tools": "android, firebase, django, icecast",
    "source": "https://github.com/sustcast/sustcast-android-app-v1"
  },
  "5": {
    "name": "Pneumonia Detection from Chest X-Rays",
    "description": " The purpose of this research endeavor is to address this limitation by exploring automated approaches to pneumonia detection from chest X-ray images, while maintaining a high level of accuracy. I conducted a comprehensive investigation of various machine learning methods, including Support Vector Machines, Random Forest, Logistic Regression, several modified Convolutional Neural Networks, and the Vision Transformer. Moreover, I examined the utility of transfer learning techniques and assessed the performance of each of the different models",
    "tools": "CV, DL, ML",
    "source": "https://github.com/appledora/mlpr-pneumonia-detect"
  },
  "3": {
    "name": "P2P Chat",
    "description": "A chat and file-sharing Android app, that connects two devices on the same network using their IP &designated port numbers.",

    "tools": "android, socket",
    "source": "https://github.com/appledora/P2P-chat-socket-implementation-on-android"
  },
  "4": {
    "name": "Product Recommendation System Benchmarking",
    "description": "An analytical project that uses the large Amazon Reviews Dataset to benchmark the performance of various recommendation systems. It also includes an elaborate exploratory analysis of the features.",
    "tools": "EDA, ML",
    "source": "https://github.com/appledora/mlpr-amazon_product_recommendation"
  },
  "0": {
    "name": "Image Captioning Web App",
    "description": "A simple deep learning project that uses a barebone CNN-RNN architecture to generate captions for images. The model is trained on the Flickr8k dataset. The interface is created using <b>Flask</b> and <b> Django </b>. The web app also includes features to upload images and annotate captions.",
    "tools": "CV, DL, Flask, Django",
    "source": "https://github.com/appledora/mlpr-image_caption"
  },

  "1": {
    "name": "Experiment on vanishing point detection",
    "description": "A simple experiment notebook to detect vanishing points in images using the Hough Transform, coupled with filtration, MSE etc. The project was done as a part of the Computer Vision course.",
    "tools": "CV, python",
    "source": "https://github.com/appledora/mlpr-vanishing-point"
  },
  "2": {
    "name": "Predict Energy Consumption of buildings from their attributes and weather data",
    "description": "An extensive analysis of the <a href='https://www.kaggle.com/competitions/widsdatathon2022/data'> <b>WIDS'22 Building Energy Prediction</b></a> dataset. The project includes a detailed exploratory analysis of the features, followed by a comparison of various machine learning models.",
    "tools": "EDA, ML, DL",
    "source": "https://github.com/appledora/mlpr-weather_energy"
  },
  "10": {
    "name": "mwTokenizer",
    "description": "Python package to perform language-agnostic tokenization. Researchers can start with a Wikipedia article (wikitext or HTML), strip syntax to leave just paragraphs of plaintext, and then further tokenize these sentences into sentences and words for input into models. <a href='https://pypi.org/project/mwtokenizer/'> <b>Install from PyPI</b></a>",
    "tools": "python, regex, tokenizer, benchmarking",
    "source": "https://gitlab.wikimedia.org/repos/research/wiki-nlp-tools"
  }
}
